app/controllers/users_backoffice/profile_controller.rb

  def edit
    @user.build_user_profile if @user.user_profile.blank?
---
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

  def update
    if @user.update(params_user)
---
UPDATE "users" SET "last_name" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_name", "Gilberto"], ["encrypted_password", "$2a$12$abYU5UxXZkT1c1.Zf7dDbujfPhuM7on7QLhiBZjVGxtVxzeeP1PIi"], ["updated_at", "2022-02-23 01:12:23.093121"], ["id", 1]]

  def set_user
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]