app/controllers/admins_backoffice/admins_controller.rb

SELECT  "admins".* FROM "admins" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "admins"
---
  def index
    @admins = Admin.all.page(params[:page])

INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @admin = Admin.new(params_admin)
    if @admin.save

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? ORDER BY "admins"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_admin
    @admin = Admin.find(params[:id])