app/views/site/shared/_questions.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" IN (?, ?, ?, ?, ?)  [["question_id", 1871], ["question_id", 1870], ["question_id", 1869], ["question_id", 1868], ["question_id", 1867]]
---
        <ul>
          <% question.answers.each do |answer| %>